IDENTIFICATION DIVISION.
PROGRAM-ID. EXEMPLO.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
   05 KEY-FIELD PIC X(10).
   05 DATA-FIELD PIC X(10).

WORKING-STORAGE SECTION.
01 WS-SEARCH-KEY PIC X(10) VALUE 'SEARCHKEY'.
01 WS-FOUND PIC X VALUE 'N'.

PROCEDURE DIVISION.
MAIN-LOGIC.
    OPEN INPUT INPUT-FILE.
         
    PERFORM UNTIL WS-FOUND = 'Y'
        READ INPUT-FILE
            AT END DISPLAY 'SEARCH KEY NOT FOUND'
        END-READ.
        
        IF KEY-FIELD = WS-SEARCH-KEY THEN
            MOVE 'Y' TO WS-FOUND
            DISPLAY 'SEARCH KEY FOUND: ' KEY-FIELD
            DISPLAY 'DATA: ' DATA-FIELD
        END-IF.
    END-PERFORM.
    
    CLOSE INPUT-FILE.
    
    STOP RUN.
