IDENTIFICATION DIVISION.
PROGRAM-ID. FATORIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMERO PIC 9(4).
01 WS-FATORIAL PIC 9(18) VALUE 1.
01 WS-CONTADOR PIC 9(4) VALUE 1.

PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "Digite um número: "
    ACCEPT WS-NUMERO.

    PERFORM CALCULAR-FATORIAL
    DISPLAY "O fatorial de " WS-NUMERO " é: " WS-FATORIAL
    STOP RUN.

CALCULAR-FATORIAL.
    PERFORM UNTIL WS-CONTADOR > WS-NUMERO
        MULTIPLY WS-CONTADOR BY WS-FATORIAL
        ADD 1 TO WS-CONTADOR
    END-PERFORM.
